use std::cmp::max;

///
/// Задача 67
/// https://projecteuler.net/problem=67
///
/// Начиная с вершины представленного ниже треугольника и переходя к прилежащим числам в следующем ряду,
/// максимальная возможная сумма пройденных чисел по пути от вершины до основания равна 23.
//
// 3
// 7 4
// 2 4 6
// 8 5 9 3
//
// Т.е., 3 + 7 + 4 + 9 = 23.
//
// Найти максимальную сумму при переходе от вершины до основания треугольника, представленного текстовым файлом размером 15КБ triangle.txt (щелкнуть правой кнопкой мыши и выбрать 'Save Link/Target As...'), в котором содержится треугольник с одной сотней строк.
//
// ПРИМЕЧАНИЕ: Это намного усложненная версия 18-й задачи. Данную задачу нельзя решить, испробовав каждый возможный вариант, поскольку всего их 299! Если бы удалось проверять один триллион (1012) вариантов в секунду, потребовалось бы двадцать биллионов лет, чтобы испробовать их все. Существует эффективный алгоритм решения данной задачи. ;o)
///
pub fn run(){
    let mut list = std::fs::read_to_string("./src/lesson67/p067_triangle.txt").unwrap()
        .lines()
        .map(|x|x.trim().split_whitespace().map(|x|{
            x.trim().parse::<u32>().unwrap()
        }).collect::<Vec<u32>>())
        .collect::<Vec<Vec<u32>>>();
    for row_num in (0..list.len()-1).rev(){
        for num_index in 0..list[row_num].len(){
            let ( num, left, right ) = ( &list[row_num][num_index], &list[row_num+1][num_index], &list[row_num+1][num_index+1] );
            list[row_num][num_index] = *{[ left+num, right+num ].iter().max().unwrap()};
        }
    }
    println!("resutl: {}", list[0][0]);
}